IRP/src/AccumulationRegisters/R5022T_Expenses/R5022T_Expenses.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:AccumulationRegister>
 <name>R5022T_Expenses</name>
 <registerType>Turnovers</registerType>
 <resources>
  <name>Amount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountWithTaxes</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AmountCost</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <attributes>
  <name>CalculationMovementCost</name>
  <type>
   <types>DocumentRef.CalculationMovementCosts</types>
  </type>
 </attributes>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>FixedAsset</name>
  <type>
   <types>CatalogRef.FixedAssets</types>
  </type>
 </dimensions>
 <dimensions>
  <name>LedgerType</name>
  <type>
   <types>CatalogRef.FixedAssetsLedgerTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AdditionalAnalytic</name>
  <type>
   <types>Characteristic.AddAttributeAndProperty</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CurrencyMovementType</name>
  <type>
   <types>ChartOfCharacteristicTypesRef.CurrencyMovementType</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Project</name>
  <type>
   <types>CatalogRef.Projects</types>
  </type>
 </dimensions>
</mdclass:AccumulationRegister>

IRP/src/InformationRegisters/T6095S_WriteOffBatchesInfo/T6095S_WriteOffBatchesInfo.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
 <name>T6095S_WriteOffBatchesInfo</name>
 <informationRegisterPeriodicity>RecorderPosition</informationRegisterPeriodicity>
 <writeMode>RecorderSubordinate</writeMode>
 <resources>
  <name>InvoiceAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>InvoiceTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>IndirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>IndirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraCostAmountByRatio</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraCostTaxAmountByRatio</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraDirectCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>ExtraDirectCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedCostAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedCostTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedRevenueAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>AllocatedRevenueTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>PreliminaryAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>PreliminaryTaxAmount</name>
  <type>
   <types>DefinedType.typeAmount</types>
  </type>
 </resources>
 <resources>
  <name>Quantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <resources>
  <name>PreliminaryQuantity</name>
  <type>
   <types>DefinedType.typeQuantity</types>
  </type>
 </resources>
 <dimensions>
  <name>Company</name>
  <type>
   <types>CatalogRef.Companies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Branch</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Document</name>
  <type>
   <types>DocumentRef.PurchaseInvoice</types>
   <types>DocumentRef.CommissioningOfFixedAsset</types>
   <types>DocumentRef.RetailReturnReceipt</types>
   <types>DocumentRef.SalesReturn</types>
   <types>DocumentRef.ModernizationOfFixedAsset</types>
   <types>DocumentRef.StockAdjustmentAsWriteOff</types>
   <types>DocumentRef.RetailSalesReceipt</types>
   <types>DocumentRef.WorkSheet</types>
   <types>DocumentRef.DecommissioningOfFixedAsset</types>
   <types>DocumentRef.SalesInvoice</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ProfitLossCenter</name>
  <type>
   <types>CatalogRef.BusinessUnits</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ExpenseType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>ItemKey</name>
  <type>
   <types>CatalogRef.ItemKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Currency</name>
  <type>
   <types>CatalogRef.Currencies</types>
  </type>
 </dimensions>
 <dimensions>
  <name>RowID</name>
  <type>
   <types>DefinedType.typeRowID</types>
  </type>
 </dimensions>
 <dimensions>
  <name>Batch</name>
  <type>
   <types>CatalogRef.Batches</types>
  </type>
 </dimensions>
 <dimensions>
  <name>BatchKey</name>
  <type>
   <types>CatalogRef.BatchKeys</types>
  </type>
 </dimensions>
 <dimensions>
  <name>AmountCorrectionType</name>
  <type>
   <types>EnumRef.AmountCorrectionTypes</types>
  </type>
 </dimensions>
 <dimensions>
  <name>CorrectionExpenseRevenueType</name>
  <type>
   <types>CatalogRef.ExpenseAndRevenueTypes</types>
  </type>
 </dimensions>
</mdclass:InformationRegister>

IRP/src/Enums/AmountCorrectionTypes/AmountCorrectionTypes.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
 <name>AmountCorrectionTypes</name>
 <enumValues>
  <name>Expense</name>
 </enumValues>
 <enumValues>
  <name>Revenue</name>
 </enumValues>
</mdclass:Enum>

IRP/src/AccumulationRegisters/R5022T_Expenses/ManagerModule.bsl
Procedure Expenses_Clear(DocObjectRef, Cancel) Export
	Query = New Query;
	Query.Text =
	"SELECT
	|	R5022T_Expenses.Recorder
	|FROM
	|	AccumulationRegister.R5022T_Expenses AS R5022T_Expenses
	|WHERE
	|	R5022T_Expenses.CalculationMovementCost = &CalculationMovementCost
	|GROUP BY
	|	R5022T_Expenses.Recorder";
	Query.SetParameter("CalculationMovementCost", DocObjectRef);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select();
	While QuerySelection.Next() Do
		RecordSet = CreateRecordSet();
		RecordSet.Filter.Recorder.Set(QuerySelection.Recorder);
		
		RecordSet.Read();
		ArrayForDelete = New Array();
		For Each Row In RecordSet Do
			If Row.CalculationMovementCost = DocObjectRef Then
				ArrayForDelete.Add(Row);
			EndIf;
		EndDo;
		For Each ItemForDelete In ArrayForDelete Do
			RecordSet.Delete(ItemForDelete);
		EndDo;
		
		RecordSet.Write();
	EndDo;
EndProcedure

Procedure Expenses_LoadRecords(CalculationMovementCostRef) Export
	Query = New Query;
	Query.Text =
	"SELECT
	|	Reg.Period AS Period,
	|	Reg.Recorder AS CalculationMovementCosts,
	|	Reg.Document AS Document,
	|	Reg.Company AS Company,
	|	Reg.Branch AS Branch,
	|	Reg.ProfitLossCenter AS ProfitLossCenter,
	|	Reg.ExpenseType AS ExpenseType,
	|	Reg.ItemKey AS ItemKey,
	|	Reg.Currency AS Currency,
	|	Reg.RowID AS Key,
	|
	|	Reg.InvoiceAmount 
	|	+ Reg.PreliminaryAmount 
	|	+ Reg.IndirectCostAmount 
	|	+ Reg.ExtraCostAmountByRatio 
	|	+ Reg.ExtraDirectCostAmount 
	|	+ Reg.AllocatedCostAmount 
	|	- Reg.AllocatedRevenueAmount AS Amount,
	|	
	|	Reg.InvoiceAmount 
	|	+ Reg.PreliminaryAmount 
	|	+ Reg.InvoiceTaxAmount 
	|	+ Reg.PreliminaryTaxAmount 
	|	+ Reg.IndirectCostAmount
	|	+ Reg.IndirectCostTaxAmount 
	|	+ Reg.ExtraCostAmountByRatio 
	|	+ Reg.ExtraCostTaxAmountByRatio 
	|	+ Reg.ExtraDirectCostAmount
	|	+ Reg.ExtraDirectCostTaxAmount 
	|	+ Reg.AllocatedCostAmount 
	|	+ Reg.AllocatedCostTaxAmount 
	|	- Reg.AllocatedRevenueAmount 
	|	- Reg.AllocatedRevenueTaxAmount AS AmountWithTaxes
	|into expenses
	|FROM
	|	InformationRegister.T6095S_WriteOffBatchesInfo AS Reg
	|WHERE
	|	Reg.Recorder = &Recorder
	|	AND Reg.AmountCorrectionType = VALUE(enum.AmountCorrectionTypes.EmptyRef)
	|
	|union all
	|
	|SELECT
	|	Reg.Period,
	|	Reg.Recorder,
	|	Reg.Document,
	|	Reg.Company,
	|	Reg.Branch,
	|	Reg.ProfitLossCenter,
	|	Reg.CorrectionExpenseRevenueType,
	|	Reg.ItemKey,
	|	Reg.Currency,
	|	"""",  //|	Reg.RowID,
	|
	|	Reg.InvoiceAmount,
	|	
	|	Reg.InvoiceAmount 
	|	+ Reg.InvoiceTaxAmount
	|
	|FROM
	|	InformationRegister.T6095S_WriteOffBatchesInfo AS Reg
	|WHERE
	|	Reg.Recorder = &Recorder
	|	AND Reg.AmountCorrectionType = VALUE(enum.AmountCorrectionTypes.Expense)
	|;
	|select * from expenses totals by Document";

	Query.SetParameter("Recorder", CalculationMovementCostRef);
	QueryResult = Query.Execute();
	QuerySelection = QueryResult.Select(QueryResultIteration.ByGroups);
	While QuerySelection.Next() Do
		
		RecordSet = CreateRecordSet();
		RecordSet.Filter.Recorder.Set(QuerySelection.Document);
		
		ExpenseTable = RecordSet.Unload();
		ExpenseTable.Columns.Delete(ExpenseTable.Columns.PointInTime);
		ExpenseTable.Columns.Add("Key", Metadata.DefinedTypes.typeRowID.Type);
		
		QuerySelectionDetails = QuerySelection.Select();
		While QuerySelectionDetails.Next() Do
			NewRow = ExpenseTable.Add();
			FillPropertyValues(NewRow, QuerySelectionDetails);
			NewRow.Recorder = QuerySelection.Document;
			NewRow.Period   = QuerySelectionDetails.Period;
			NewRow.CalculationMovementCost = QuerySelectionDetails.CalculationMovementCosts;
		EndDo;
	
		// Currency calculation
		
		CurrenciesParameters = New Structure();

		PostingDataTables = New Map();
		
		ExpenseTableSettings = PostingServer.PostingTableSettings(ExpenseTable, RecordSet);
		PostingDataTables.Insert(RecordSet.Metadata(), ExpenseTableSettings);
		
		ArrayOfPostingInfo = New Array();
		For Each DataTable In PostingDataTables Do
			ArrayOfPostingInfo.Add(DataTable);
		EndDo;
		CurrenciesParameters.Insert("Object", QuerySelection.Document);
		CurrenciesParameters.Insert("Metadata", QuerySelection.Document.Metadata());
		CurrenciesParameters.Insert("ArrayOfPostingInfo", ArrayOfPostingInfo);
		CurrenciesServer.PreparePostingDataTables(CurrenciesParameters, Undefined);

		For Each ItemOfPostingInfo In ArrayOfPostingInfo Do
			If ItemOfPostingInfo.Key = Metadata.AccumulationRegisters.R5022T_Expenses Then
				RecordSet.Read();
				For Each RowPostingInfo In ItemOfPostingInfo.Value.PrepareTable Do
					FillPropertyValues(RecordSet.Add(), RowPostingInfo);
				EndDo;
				RecordSet.SetActive(True);
				RecordSet.Write();
			EndIf;			
		EndDo;
	EndDo;
EndProcedure

#Region AccessObject

// Get access key.
// See Role.TemplateAccumulationRegisters - Parameters orders has to be the same
// 
// Returns:
//  Structure - Get access key:
// * Company - CatalogRef.Companies -
// * Branch - CatalogRef.BusinessUnits -
Function GetAccessKey() Export
	AccessKeyStructure = New Structure;
	AccessKeyStructure.Insert("Company", Catalogs.Companies.EmptyRef());
	AccessKeyStructure.Insert("Branch", Catalogs.BusinessUnits.EmptyRef());
	Return AccessKeyStructure;
EndFunction

#EndRegion

// Additional data filling.
// 
// Parameters:
//  MovementsValueTable - ValueTable
Procedure AdditionalDataFilling(MovementsValueTable) Export
	Return;	
EndProcedure
